www/lrn/lisp/lisp-9.html
<!DOCTYPE html>
<html>
<head>
<title></title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">План работ</a></li>
<li><a href="#unnumbered-2">Глобальное окружение</a></li>
<li><a href="#unnumbered-3">Функции для тестирования</a></li>
<li><a href="#unnumbered-4">Структура замыкания</a></li>
<li><a href="#unnumbered-5">MyApply</a>
<ul>
<li><a href="#unnumbered-6">Работа с CONS-ячейками</a></li>
<li><a href="#unnumbered-7">NULL-предикат</a></li>
<li><a href="#unnumbered-8">Встроенные функции арифметики</a></li>
<li><a href="#unnumbered-9">CLOSURE</a></li>
<li><a href="#unnumbered-10">PRINT</a></li>
<li><a href="#unnumbered-11">LIST</a></li>
<li><a href="#unnumbered-12"><span class="todo nilTODO">TODO</span> CALL/CC</a></li>
</ul>
</li>
<li><a href="#unnumbered-13">MyEval</a>
<ul>
<li><a href="#unnumbered-14">Самовычисляемые формы</a></li>
<li><a href="#unnumbered-15">Вычисление символов</a></li>
<li><a href="#unnumbered-16">Цитирование</a></li>
<li><a href="#unnumbered-17">Условное выполнение IF</a></li>
<li><a href="#unnumbered-18">COND</a></li>
<li><a href="#unnumbered-19">PROGN</a></li>
<li><a href="#unnumbered-20">AND</a></li>
<li><a href="#unnumbered-21">OR</a></li>
<li><a href="#unnumbered-22">LET</a></li>
<li><a href="#unnumbered-23">LET*</a></li>
<li><a href="#unnumbered-24">DEFUN</a></li>
<li><a href="#unnumbered-25">SETQ</a></li>
<li><a href="#unnumbered-26">LAMBDA</a></li>
<li><a href="#unnumbered-27">BLOCK</a></li>
<li><a href="#unnumbered-28">RETURN-FROM</a></li>
<li><a href="#unnumbered-29">CATCH</a></li>
<li><a href="#unnumbered-30">THROW</a></li>
<li><a href="#unnumbered-31">TAGBODY</a></li>
<li><a href="#unnumbered-32">GO</a></li>
<li><a href="#unnumbered-33">LABELS</a></li>
<li><a href="#unnumbered-34">RESET</a></li>
<li><a href="#unnumbered-35">SHIFT</a></li>
</ul>
</li>
<li><a href="#unnumbered-36">Repl</a></li>
<li><a href="#unnumbered-37">Итоги</a></li>
</ul>
</div>
</div>

<div id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">План работ</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
[TODO:gmm] Добавить call/cc, shift и reset, а также repl
</p>

<p>
На этом этапе мы проведем дефункционализацию.
</p>

<p>
Выносим применение продолжения в отдельную функцию. Большинство продолжений принимают
один аргумент, но есть и такие (в <code>go</code>) которые не принимают аргументов.
</p>

<p>
Также продолжения могут быть представлены структурами
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="errors_9">(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">unknown-continuation</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((cont <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:cont</span>  <span style="color: #5f5f87;">:reader</span> cont))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in APPLY-CONTINUATION: unknown-continuation: ~A"</span>
             (cont condition)))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-lisp" id="apply_continuation_9">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">apply-continuation</span> (cont arg)
  (<span style="color: #af00ff;">cond</span> ((and (functionp cont)
              (equal arg 'NOT-A-PARAM))
                                (funcall cont))
        ((functionp cont)       (funcall cont arg))
        ((evcond-cont-p cont)   (<span style="color: #af00ff;">if</span> arg
                                    (myeval (cadar (evcond-cont-clauses cont))
                                            (evcond-cont-env cont)
                                            (evcond-cont-block-env cont)
                                            (evcond-cont-go-env cont)
                                            (evcond-cont-catch-env cont)
                                            (evcond-cont-errcont cont)
                                            (evcond-cont-cont cont))
                                    (evcond (cdr (evcond-cont-clauses cont))
                                            (evcond-cont-env cont)
                                            (evcond-cont-block-env cont)
                                            (evcond-cont-go-env cont)
                                            (evcond-cont-catch-env cont)
                                            (evcond-cont-errcont cont)
                                            (evcond-cont-cont cont))))
        ((evlis-cont-p cont)    (evlis (evlis-cont-fn cont)
                                       (cdr (evlis-cont-unevaled cont))
                                       (cons arg (evlis-cont-evaled cont))
                                       (evlis-cont-env cont)
                                       (evlis-cont-block-env cont)
                                       (evlis-cont-go-env cont)
                                       (evlis-cont-catch-env cont)
                                       (evlis-cont-errcont cont)
                                       (evlis-cont-cont cont)))
        (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-continuation <span style="color: #5f5f87;">:cont</span> cont))))
</pre>
</div>
</div>
</div>
