www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Глобальное окружение</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Меняем <code>funcall</code> на <code>apply-continuation</code>:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="assoc_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-2</span> (key alist cont errcont) <span style="color: #af0000;">;; </span><span style="color: #af0000;">NB!: inverted order of</span>
                                        <span style="color: #af0000;">;; </span><span style="color: #af0000;">continuations (for lookup)</span>
  (<span style="color: #af00ff;">cond</span> ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-2</span> (key alist cont errcont) <span style="color: #af0000;">;; </span><span style="color: #af0000;">NB!: inverted order of</span>
                                        <span style="color: #af0000;">;; </span><span style="color: #af0000;">continuations (for lookup)</span>
  (<span style="color: #af00ff;">cond</span> ((null alist)              (apply-continuation errcont key))
        ((equal key (caar alist))  (apply-continuation cont (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="assoc_9_test">(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"ok:123"</span>
               (assoc-2 'alfa '((alfa . 123))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"err:ALFA"</span>
               (assoc-2 'alfa '((beta . 123))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x))
                        (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x)))))
</pre>
</div>

<p>
Заменяем передачу продолжения <code>cont</code> в <code>assoc</code> на <code>(apply-continuation cont ...)</code>. Также
заменяем вызов <code>funcall errcont</code> на <code>(apply-continuation errcont ...)</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">environment</span>
(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">lookup (old)</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env errcont cont)
  (assoc-2 symb env cont
           (<span style="color: #af00ff;">lambda</span> (key)
             (assoc-2 key *glob-env* cont
                      (<span style="color: #af00ff;">lambda</span> (key)
                        (funcall errcont
                                 (format
                                  nil
                                  <span style="color: #87005f;">"UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"</span>
                                  key env *glob-env*)))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">lookup</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env errcont cont)
  (assoc-2 symb env
           (<span style="color: #af00ff;">lambda</span> (x)
             (apply-continuation cont x))
           (<span style="color: #af00ff;">lambda</span> (key)
             (assoc-2 key *glob-env* cont
                      (<span style="color: #af00ff;">lambda</span> (key)
                        (apply-continuation
                         errcont
                         (format
                          nil <span style="color: #87005f;">"UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"</span>
                          key env *glob-env*)))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="lookup_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">test lookup</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"ok:123"</span> (lookup 'aaa '((aaa . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil      (lookup 'aaa '((bbb . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (<span style="color: #af00ff;">declare</span> (ignore x)) nil)
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
</pre>
</div>
</div>
</div>
