www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-9" class="outline-3">
<h3 id="unnumbered-9">CLOSURE</h3>
<div class="outline-text-3" id="text-unnumbered-9">
<p>
Тут без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_closure_9">((closure-p fn)              (myeval (closure-body fn)
                                     (pairlis (closure-args fn)
                                              args
                                              (closure-env fn))
                                     (closure-block-env fn)
                                     (closure-go-env fn)
                                     catch-env
                                     errcont cont))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_closure_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; CLOSURE</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(((<span style="color: #af00ff;">lambda</span> (x)
                              (<span style="color: #af00ff;">lambda</span> (y) x))
                            1)
                           2)
                         nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-10" class="outline-3">
<h3 id="unnumbered-10">PRINT</h3>
<div class="outline-text-3" id="text-unnumbered-10">
<p>
[TODO:gmm] Сделать проверку аргументов
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_print_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
((equal fn 'print)           (apply-continuation cont (print (car args))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
((equal fn 'print)           (funcall cont (print (car args))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_print_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; host-&#1086;&#1074;&#1099;&#1084; print</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (print 12))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print 12) nil nil nil nil #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (print 12)
               (myeval '(print 12) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (<span style="color: #af00ff;">let</span> ((a 12))
                   (print a)))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print a)
                         '((b . 23) (a . 12))
                         nil nil nil #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 12))
                 (print a))
               (myeval '(print a)
                       '((b . 23) (a . 12))
                       nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-11" class="outline-3">
<h3 id="unnumbered-11">LIST</h3>
<div class="outline-text-3" id="text-unnumbered-11">
<p>
Определим структуру для сохранения продолжения EVLIS:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_cont_9">(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">evlis-cont</span>
  fn unevaled evaled env block-env go-env catch-env errcont cont)
</pre>
</div>

<p>
Теперь <code>evlis</code>, в случае получения непустого <code>unevaled</code> будет создавать эту структуру и
передавать её в качестве продолжения в <code>myeval</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="evlis_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) catch-env errcont cont))
        (t                (myeval (car unevaled) env block-env go-env catch-env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis fn
                                           (cdr unevaled)
                                           (cons x evaled)
                                           env block-env go-env catch-env
                                           errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) catch-env errcont cont))
        (t                (myeval (car unevaled) env block-env go-env catch-env errcont
                                  (make-evlis-cont
                                   <span style="color: #5f5f87;">:fn</span> fn
                                   <span style="color: #5f5f87;">:unevaled</span> unevaled
                                   <span style="color: #5f5f87;">:evaled</span> evaled
                                   <span style="color: #5f5f87;">:env</span> env
                                   <span style="color: #5f5f87;">:block-env</span> block-env
                                   <span style="color: #5f5f87;">:go-env</span> go-env
                                   <span style="color: #5f5f87;">:catch-env</span> catch-env
                                   <span style="color: #5f5f87;">:errcont</span> errcont
                                   <span style="color: #5f5f87;">:cont</span> cont)))))
</pre>
</div>

<p>
[TODO:gmm] Этого вообще нет в исходнике почему-то. APPLY-CONTINATIONS?
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_list_9">((equal fn 'list)            (funcall cont args))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_evlis_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 4           (evlis '+     '(1 (+ 1 2))   nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 1 3 5)   (evlis '+     '(1 (+ 1 2) 5) nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 3 5)    (evlis 'list  '(1 (+ 1 2) 5) nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(0 3 6 42) (evlis 'list  '(0 (+ a b) (* b c) 42)
                                  nil
                                  '((a . 1) (b . 2) (c . 3) (d . 4))
                                  nil nil nil  #'err #'ok)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_list_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LIST</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 14) (myeval '(list 1 (+ 2 (* 3 4)))
                               nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ a b) (* b c) 42)
                       '((a . 1) (b . 2) (c . 3) (d . 4))
                       nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
