org/lrn/lisp/lisp-9.org
** TODO CALL/CC

Когда мы встречаем инструкцию ~call/cc~ мы ожидаем, что она содержит лямбду, которая
принимает один функциональный аргумент. Мы хотим вычислить (apply) эту лямбду, передав
ей в качестве этого аргумента текущее продолжение.

Когда эта лямбда попадает в ~myapply~ она будет представлена как функция (пока у нас
нет объектов-функций) и нам останется только применить эту функцию к ее аргументу.

#+NAME: myapply_callcc_9
#+BEGIN_SRC lisp
  ((equal fn 'call/cc)         (myapply (car args) (list cont) catch-env errcont cont))
  ((functionp fn)              (apply fn args))      ; interim hack
#+END_SRC

Чтобы написать тест на ~call/cc~ мы можем сформировать такое выражение. Здесь в
~call/cc~ передается продолжение из интерпретатора, которое будет вызвано внутри лямбды
и вернет результат "11", который станет частью выражения "(+ 1 2 [])".

#+NAME: myapply_callcc_9_test
#+BEGIN_SRC lisp
  ;; Тесты для CALL/CC
  ;; (assert (equal 14 (myeval '(+ 1 2 (call/cc (lambda (x) (+ 3 4) (x (+ 5 6)) (+7 8))))
  ;;                           nil nil nil nil #'err #'ok)))
#+END_SRC

* MyEval

#+NAME: myeval_9
#+BEGIN_SRC lisp
  <<evcond_cont_9>>
  <<myeval_evcond_9>>
  <<myeval_evprogn_9>>
  <<myeval_evand_9>>
  <<myeval_evor_9>>
  <<myeval_mypairlis_9>>
  <<myeval_evlet_9>>
  <<myeval_evletstar_9>>
  <<myeval_evtagbody_9>>
  (defun myeval (exp env block-env go-env catch-env errcont cont)
    (cond
      <<myeval_number_9>>
      <<myeval_symb_9>>
      <<myeval_quote_9>>
      <<myeval_if_9>>
      <<myeval_cond_9>>
      <<myeval_progn_9>>
      <<myeval_and_9>>
      <<myeval_or_9>>
      <<myeval_let_9>>
      <<myeval_letstar_9>>
      <<myeval_defun_9>>
      <<myeval_setq_9>>
      <<myeval_lambda_9>>
      <<myeval_block_9>>
      <<myeval_return_from_9>>
      <<myeval_catch_9>>
      <<myeval_throw_9>>
      <<myeval_return_from_9>>
      <<myeval_catch_9>>
      <<myeval_throw_9>>
      <<myeval_tagbody_9>>
      <<myeval_go_9>>
      <<myeval_labels_9>>
      <<myeval_reset_9>>
      <<myeval_shift_9>>
      (t
       (myeval (car exp) env block-env go-env catch-env errcont
               (lambda (x)
                 (evlis x (cdr exp) nil env block-env go-env catch-env errcont cont))))))
#+END_SRC

Тесты:

#+NAME: myeval_9_test
#+BEGIN_SRC lisp
  <<myeval_number_9_test>>
  <<myeval_symb_9_test>>
  <<myeval_quote_9_test>>
  <<myeval_if_9_test>>
  <<myeval_evcond_9_test>>
  <<myeval_cond_9_test>>
  <<myeval_evprogn_9_test>>
  <<myeval_progn_9_test>>
  <<myeval_evand_9_test>>
  <<myeval_and_9_test>>
  <<myeval_evor_9_test>>
  <<myeval_or_9_test>>
  <<myeval_mypairlis_9_test>>
  <<myeval_evlet_9_test>>
  <<myeval_let_9_test>>
  <<myeval_evletstar_9_test>>
  <<myeval_letstar_9_test>>
  <<myeval_defun_9_test>>
  <<myeval_setq_9_test>>
  <<myeval_lambda_9_test>>
  <<myeval_block_9_test>>
  <<myeval_return_from_9_test>>
  <<myeval_catch_9_test>>
  <<myeval_throw_9_test>>
  <<myeval_tagbody_9_test>>
  <<myeval_go_9_test>>
  <<myeval_labels_9_test>>
  <<myeval_reset_9_test>>
  <<myeval_shift_9_test>>
#+END_SRC

** Самовычисляемые формы

Замена ~funcall cont~ на ~apply-continauation~

#+NAME: myeval_number_9
#+BEGIN_SRC lisp
  ;; стало
  ((null exp)                  (apply-continuation cont 'nil))
  ((equal 't exp)              (apply-continuation cont 't))
  ((member exp '(+ * car cdr cons null print list call/cc repl))  (apply-continuation cont exp))
  ((numberp exp)               (apply-continuation cont exp))
  ;; было
  ((null exp)                  (funcall cont 'nil))
  ((equal t exp)               (funcall cont 't))
  ((member exp '(+ * car cdr cons null print list))  (funcall cont exp))
  ((numberp exp)               (funcall cont exp))
#+END_SRC

#+NAME: myeval_number_9_test
#+BEGIN_SRC lisp
  ;; Тесты для самовычисляемых форм
  (assert (equal T (myeval 'T nil nil nil nil #'err #'ok)))
  (assert (equal NIL (myeval 'NIL nil nil nil nil #'err #'ok)))
  (assert (equal 999 (myeval 999 nil nil nil nil #'err #'ok)))
#+END_SRC

** Вычисление символов

Без изменений

#+NAME: myeval_symb_9
#+BEGIN_SRC lisp
  ((symbolp exp)               (lookup exp env errcont cont))
#+END_SRC

#+NAME: myeval_symb_9_test
#+BEGIN_SRC lisp
  ;; Тесты для вычисления символов
  (assert (equal 6 (myeval 'b '((a . 3) (b . 6)) nil nil nil #'err #'ok)))
  (assert (equal "error" (car (myeval 'b nil nil nil nil
                                      #'(lambda (x) (cons "error" x))
                                      #'ok))))
#+END_SRC

** Цитирование

Замена ~funcall cont~ на ~apply-continauation~

#+NAME: myeval_quote_9
#+BEGIN_SRC lisp
  ;; стало
  ((equal (car exp) 'quote)    (apply-continuation cont (cadr exp)))
  ;; было
  ((equal (car exp) 'quote)    (funcall cont (cadr exp)))
#+END_SRC

#+NAME: myeval_quote_9_test
#+BEGIN_SRC lisp
  ;; Тесты для QUOTE
  (assert (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil nil nil nil #'err #'ok)))
#+END_SRC

