www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-12" class="outline-3">
<h3 id="unnumbered-12"><span class="todo TODO">TODO</span> CALL/CC</h3>
<div class="outline-text-3" id="text-unnumbered-12">
<p>
Когда мы встречаем инструкцию <code>call/cc</code> мы ожидаем, что она содержит лямбду, которая
принимает один функциональный аргумент. Мы хотим вычислить (apply) эту лямбду, передав
ей в качестве этого аргумента текущее продолжение.
</p>

<p>
Когда эта лямбда попадает в <code>myapply</code> она будет представлена как функция (пока у нас
нет объектов-функций) и нам останется только применить эту функцию к ее аргументу.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_callcc_9">((equal fn 'call/cc)         (myapply (car args) (list cont) catch-env errcont cont))
((functionp fn)              (apply fn args))      <span style="color: #af0000;">; interim hack</span>
</pre>
</div>

<p>
Чтобы написать тест на <code>call/cc</code> мы можем сформировать такое выражение. Здесь в
<code>call/cc</code> передается продолжение из интерпретатора, которое будет вызвано внутри лямбды
и вернет результат "11", который станет частью выражения "(+ 1 2 [])".
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myapply_callcc_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; CALL/CC</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(assert (equal 14 (myeval '(+ 1 2 (call/cc (lambda (x) (+ 3 4) (x (+ 5 6)) (+7 8))))</span>
<span style="color: #af0000;">;;                           </span><span style="color: #af0000;">nil nil nil nil #'err #'ok)))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-unnumbered-13" class="outline-2">
<h2 id="unnumbered-13">MyEval</h2>
<div class="outline-text-2" id="text-unnumbered-13">
<div class="org-src-container">

<pre class="src src-lisp" id="myeval_9">&lt;&lt;evcond_cont_9&gt;&gt;
&lt;&lt;myeval_evcond_9&gt;&gt;
&lt;&lt;myeval_evprogn_9&gt;&gt;
&lt;&lt;myeval_evand_9&gt;&gt;
&lt;&lt;myeval_evor_9&gt;&gt;
&lt;&lt;myeval_mypairlis_9&gt;&gt;
&lt;&lt;myeval_evlet_9&gt;&gt;
&lt;&lt;myeval_evletstar_9&gt;&gt;
&lt;&lt;myeval_evtagbody_9&gt;&gt;
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    &lt;&lt;myeval_number_9&gt;&gt;
    &lt;&lt;myeval_symb_9&gt;&gt;
    &lt;&lt;myeval_quote_9&gt;&gt;
    &lt;&lt;myeval_if_9&gt;&gt;
    &lt;&lt;myeval_cond_9&gt;&gt;
    &lt;&lt;myeval_progn_9&gt;&gt;
    &lt;&lt;myeval_and_9&gt;&gt;
    &lt;&lt;myeval_or_9&gt;&gt;
    &lt;&lt;myeval_let_9&gt;&gt;
    &lt;&lt;myeval_letstar_9&gt;&gt;
    &lt;&lt;myeval_defun_9&gt;&gt;
    &lt;&lt;myeval_setq_9&gt;&gt;
    &lt;&lt;myeval_lambda_9&gt;&gt;
    &lt;&lt;myeval_block_9&gt;&gt;
    &lt;&lt;myeval_return_from_9&gt;&gt;
    &lt;&lt;myeval_catch_9&gt;&gt;
    &lt;&lt;myeval_throw_9&gt;&gt;
    &lt;&lt;myeval_return_from_9&gt;&gt;
    &lt;&lt;myeval_catch_9&gt;&gt;
    &lt;&lt;myeval_throw_9&gt;&gt;
    &lt;&lt;myeval_tagbody_9&gt;&gt;
    &lt;&lt;myeval_go_9&gt;&gt;
    &lt;&lt;myeval_labels_9&gt;&gt;
    &lt;&lt;myeval_reset_9&gt;&gt;
    &lt;&lt;myeval_shift_9&gt;&gt;
    (t
     (myeval (car exp) env block-env go-env catch-env errcont
             (<span style="color: #af00ff;">lambda</span> (x)
               (evlis x (cdr exp) nil env block-env go-env catch-env errcont cont))))))
</pre>
</div>

<p>
Тесты:
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_9_test">&lt;&lt;myeval_number_9_test&gt;&gt;
&lt;&lt;myeval_symb_9_test&gt;&gt;
&lt;&lt;myeval_quote_9_test&gt;&gt;
&lt;&lt;myeval_if_9_test&gt;&gt;
&lt;&lt;myeval_evcond_9_test&gt;&gt;
&lt;&lt;myeval_cond_9_test&gt;&gt;
&lt;&lt;myeval_evprogn_9_test&gt;&gt;
&lt;&lt;myeval_progn_9_test&gt;&gt;
&lt;&lt;myeval_evand_9_test&gt;&gt;
&lt;&lt;myeval_and_9_test&gt;&gt;
&lt;&lt;myeval_evor_9_test&gt;&gt;
&lt;&lt;myeval_or_9_test&gt;&gt;
&lt;&lt;myeval_mypairlis_9_test&gt;&gt;
&lt;&lt;myeval_evlet_9_test&gt;&gt;
&lt;&lt;myeval_let_9_test&gt;&gt;
&lt;&lt;myeval_evletstar_9_test&gt;&gt;
&lt;&lt;myeval_letstar_9_test&gt;&gt;
&lt;&lt;myeval_defun_9_test&gt;&gt;
&lt;&lt;myeval_setq_9_test&gt;&gt;
&lt;&lt;myeval_lambda_9_test&gt;&gt;
&lt;&lt;myeval_block_9_test&gt;&gt;
&lt;&lt;myeval_return_from_9_test&gt;&gt;
&lt;&lt;myeval_catch_9_test&gt;&gt;
&lt;&lt;myeval_throw_9_test&gt;&gt;
&lt;&lt;myeval_tagbody_9_test&gt;&gt;
&lt;&lt;myeval_go_9_test&gt;&gt;
&lt;&lt;myeval_labels_9_test&gt;&gt;
&lt;&lt;myeval_reset_9_test&gt;&gt;
&lt;&lt;myeval_shift_9_test&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-unnumbered-14" class="outline-3">
<h3 id="unnumbered-14">Самовычисляемые формы</h3>
<div class="outline-text-3" id="text-unnumbered-14">
<p>
Замена <code>funcall cont</code> на <code>apply-continauation</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
((null exp)                  (apply-continuation cont 'nil))
((equal 't exp)              (apply-continuation cont 't))
((member exp '(+ * car cdr cons null print list call/cc repl))  (apply-continuation cont exp))
((numberp exp)               (apply-continuation cont exp))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
((null exp)                  (funcall cont 'nil))
((equal t exp)               (funcall cont 't))
((member exp '(+ * car cdr cons null print list))  (funcall cont exp))
((numberp exp)               (funcall cont exp))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_number_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999 nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-15" class="outline-3">
<h3 id="unnumbered-15">Вычисление символов</h3>
<div class="outline-text-3" id="text-unnumbered-15">
<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_9">((symbolp exp)               (lookup exp env errcont cont))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_symb_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (car (myeval 'b nil nil nil nil
                                    #'(<span style="color: #af00ff;">lambda</span> (x) (cons <span style="color: #87005f;">"error"</span> x))
                                    #'ok))))
</pre>
</div>
</div>
</div>
