www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-19" class="outline-3">
<h3 id="unnumbered-19">PROGN</h3>
<div class="outline-text-3" id="text-unnumbered-19">
<p>
[TODO:gmm] Нет продолжения <code>evprogn-cont</code> в исходнике почему-то
[TODO:gmm] Новый <code>evprogn</code> отличается только вызовом <code>apply-continuation</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evprogn_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)         (funcall cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env go-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env go-env catch-env errcont
                                    (<span style="color: #af00ff;">lambda</span> (x)
                                      (evprogn (cdr lst)
                                               env block-env go-env catch-env
                                               errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)         (apply-continuation cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env go-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env go-env catch-env errcont
                                    (<span style="color: #af00ff;">lambda</span> (x)
                                      (<span style="color: #af00ff;">declare</span> (ignore x))
                                      (evprogn (cdr lst)
                                               env block-env go-env catch-env
                                               errcont cont))))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_evprogn_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evprogn '(1 2) nil nil nil nil  #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (evprogn '(a b c)
                          '((a . 1) (b . 2) (c . 3))
                           nil nil nil #'err #'ok)))
</pre>
</div>

<p>
Без изменений
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_9">((equal (car exp) 'progn)    (evprogn (cdr exp)
                                      env block-env go-env catch-env
                                      errcont cont))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_progn_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> a b c) '((a . 1) (b . 2) (c . 3))
                         nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>
