www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-24" class="outline-3">
<h3 id="unnumbered-24">DEFUN</h3>
<div class="outline-text-3" id="text-unnumbered-24">
<p>
[TODO:gmm] В текущей реализации мы не перезаписываем уже определенную функцию!
</p>

<p>
Заменяем <code>funcall cont</code> на <code>apply-continuation</code>
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_defun_9"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
((equal (car exp) 'defun)         (<span style="color: #af00ff;">progn</span>
                                    (push (cons (cadr exp)
                                                (make-closure <span style="color: #5f5f87;">:body</span> (cadddr exp)
                                                              <span style="color: #5f5f87;">:block-env</span> block-env
                                                              <span style="color: #5f5f87;">:env</span> env
                                                              <span style="color: #5f5f87;">:go-env</span> go-env
                                                              <span style="color: #5f5f87;">:args</span> (caddr exp)))
                                          *glob-env*)
                                    (apply-continuation cont (cadr exp))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
((equal (car exp) 'defun)         (<span style="color: #af00ff;">progn</span>
                                    (push (cons (cadr exp)
                                                (make-closure <span style="color: #5f5f87;">:body</span> (cadddr exp)
                                                              <span style="color: #5f5f87;">:env</span> env
                                                              <span style="color: #5f5f87;">:block-env</span> block-env
                                                              <span style="color: #5f5f87;">:go-env</span> go-env
                                                              <span style="color: #5f5f87;">:args</span> (caddr exp)))
                                          *glob-env*)
                                    (funcall cont (cadr exp))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_defun_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; DEFUN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 64 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (myeval '(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">alfa</span> (x) (* x x)) nil nil nil nil #'err #'ok)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(alfa 8) nil nil nil nil #'err #'ok)
                      (setf *glob-env* nil)))))
</pre>
</div>
</div>
</div>
