org/lrn/lisp/lisp-9.org
** RESET

Когда мы встречаем ~reset~ мы как бы "сбрасываем стек", т.е. вычисляем внутреннюю форму
в "identity-continuation", в результате чего эта форма возвращает значение. Это
значение мы передаем как параметр продолжения ~cont~.

#+NAME: myeval_reset_9
#+BEGIN_SRC lisp
  ((equal (car exp) 'reset)    (funcall cont (myeval (cadr exp)
                                                     env block-env go-env catch-env
                                                     errcont #'identity)))
#+END_SRC

Тест так себе, но ничего более умного не придумалось

#+NAME: myeval_reset_9_test
#+BEGIN_SRC lisp
  ;; Тесты для RESET
  (assert (equal 8 (myeval '(progn
                              (+ 1 (reset (+ 2 3)) 2))
                              nil nil nil nil #'err #'ok)))
#+END_SRC

** SHIFT

В выражении ~(shift x form)~ SHIFT биндит к переменной ~x~ продолжение ~cont~. Поэтому
(даже снаружи формы) можно будет вызвать ~x~ как функцию и перейти в это продолжение. В
этом это похоже на ~call/cc~.

#+NAME: myeval_shift_9
#+BEGIN_SRC lisp
  ((equal (car exp) 'shift)    (myeval (caddr exp)
                                       (acons (cadr exp) cont env)
                                       block-env go-env catch-env
                                       errcont cont))
#+END_SRC

Тут мы сохраняем продолжение в переменной и используем его, чтобы возвращаться в него и
вычислять то что происходит между ~reset~ и ~shift~.

#+NAME: myeval_shift_9_test
#+BEGIN_SRC lisp
  ;; Тесты для SHIFT/RESET
  (assert (equal 44 (myeval '(let ((foo))
                              (+ 1 (reset (+ 2 (shift f (progn (setq foo f) 4)))))
                              (foo 42))
                            nil nil nil nil #'err #'ok)))
#+END_SRC

*
* Repl

#+NAME: repl_9
#+BEGIN_SRC lisp
 (defun repl (prompt catch-env errcont cont)
   (format t "~%~A> " prompt)
   (myeval (read) nil nil nil (acons 'exit cont catch-env)
     #'(lambda (x)
         (princ x)
         (terpri)
         (finish-output)
         (repl prompt catch-env errcont cont))
     #'(lambda (x)
         (princ x)
         (terpri)
         (finish-output)
         (repl prompt catch-env errcont cont))))
#+END_SRC

