www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-34" class="outline-3">
<h3 id="unnumbered-34">RESET</h3>
<div class="outline-text-3" id="text-unnumbered-34">
<p>
Когда мы встречаем <code>reset</code> мы как бы "сбрасываем стек", т.е. вычисляем внутреннюю форму
в "identity-continuation", в результате чего эта форма возвращает значение. Это
значение мы передаем как параметр продолжения <code>cont</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_reset_9">((equal (car exp) 'reset)    (funcall cont (myeval (cadr exp)
                                                   env block-env go-env catch-env
                                                   errcont #'identity)))
</pre>
</div>

<p>
Тест так себе, но ничего более умного не придумалось
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_reset_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; RESET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 8 (myeval '(<span style="color: #af00ff;">progn</span>
                            (+ 1 (reset (+ 2 3)) 2))
                            nil nil nil nil #'err #'ok)))
</pre>
</div>
</div>
</div>

<div id="outline-container-unnumbered-35" class="outline-3">
<h3 id="unnumbered-35">SHIFT</h3>
<div class="outline-text-3" id="text-unnumbered-35">
<p>
В выражении <code>(shift x form)</code> SHIFT биндит к переменной <code>x</code> продолжение <code>cont</code>. Поэтому
(даже снаружи формы) можно будет вызвать <code>x</code> как функцию и перейти в это продолжение. В
этом это похоже на <code>call/cc</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_shift_9">((equal (car exp) 'shift)    (myeval (caddr exp)
                                     (acons (cadr exp) cont env)
                                     block-env go-env catch-env
                                     errcont cont))
</pre>
</div>

<p>
Тут мы сохраняем продолжение в переменной и используем его, чтобы возвращаться в него и
вычислять то что происходит между <code>reset</code> и <code>shift</code>.
</p>

<div class="org-src-container">

<pre class="src src-lisp" id="myeval_shift_9_test"><span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; SHIFT/RESET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 44 (myeval '(<span style="color: #af00ff;">let</span> ((foo))
                            (+ 1 (reset (+ 2 (shift f (<span style="color: #af00ff;">progn</span> (setq foo f) 4)))))
                            (foo 42))
                          nil nil nil nil #'err #'ok)))
</pre>
</div>

<p>
*
</p>
</div>
</div>
</div>
<div id="outline-container-unnumbered-36" class="outline-2">
<h2 id="unnumbered-36">Repl</h2>
<div class="outline-text-2" id="text-unnumbered-36">
<div class="org-src-container">

<pre class="src src-lisp" id="repl_9">(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">repl</span> (prompt catch-env errcont cont)
  (format t <span style="color: #87005f;">"~%~A&gt; "</span> prompt)
  (myeval (read) nil nil nil (acons 'exit cont catch-env)
    #'(<span style="color: #af00ff;">lambda</span> (x)
        (princ x)
        (terpri)
        (finish-output)
        (repl prompt catch-env errcont cont))
    #'(<span style="color: #af00ff;">lambda</span> (x)
        (princ x)
        (terpri)
        (finish-output)
        (repl prompt catch-env errcont cont))))
</pre>
</div>
</div>
</div>
