www/lrn/lisp/lisp-9.html

<div id="outline-container-unnumbered-37" class="outline-2">
<h2 id="unnumbered-37">Итоги</h2>
<div class="outline-text-2" id="text-unnumbered-37">
<div class="org-src-container">

<pre class="src src-lisp">(setq *print-circle* T)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1050;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</span>
&lt;&lt;errors_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">APPLY-CONTINUATION</span>
&lt;&lt;apply_continuation_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1077;&#1088;&#1089;&#1080;&#1103; ASSOC</span>
&lt;&lt;assoc_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1053;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; lookup</span>
&lt;&lt;lookup_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1085;&#1080;&#1103;</span>
&lt;&lt;closure_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; MYAPPLY &#1080; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1082; &#1085;&#1077;&#1084;&#1091; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103;</span>
&lt;&lt;myapply_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; MYEVAL &#1080; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1082; &#1085;&#1077;&#1084;&#1091; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103;</span>
&lt;&lt;myeval_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1085;&#1086;&#1074;&#1099;&#1081; lookup</span>
&lt;&lt;lookup_9_test&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; CPS-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;</span>
&lt;&lt;ok_err_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYAPPLY</span>
&lt;&lt;myapply_9_test&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYEVAL</span>
&lt;&lt;myeval_9_test&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">REPL</span>
&lt;&lt;repl_9&gt;&gt;
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(repl)</span>
</pre>
</div>

<p>
Получиться должен вот такой результат:
</p>

<div class="org-src-container">

<pre class="src src-lisp">(setq *print-circle* T)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">APPLY-CONTINUATION</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">apply-continuation</span> (cont arg)
  (<span style="color: #af00ff;">cond</span> ((and (functionp cont)
              (equal arg 'NOT-A-PARAM))
         (funcall cont))
        ((functionp cont)       (funcall cont arg))
        ((evcond-cont-p cont)   (<span style="color: #af00ff;">if</span> arg
                                    (myeval (cadar (evcond-cont-clauses cont))
                                            (evcond-cont-env cont)
                                            (evcond-cont-block-env cont)
                                            (evcond-cont-go-env cont)
                                            (evcond-cont-catch-env cont)
                                            (evcond-cont-errcont cont)
                                            (evcond-cont-cont cont))
                                    (evcond (cdr (evcond-cont-clauses cont))
                                            (evcond-cont-env cont)
                                            (evcond-cont-block-env cont)
                                            (evcond-cont-go-env cont)
                                            (evcond-cont-catch-env cont)
                                            (evcond-cont-errcont cont)
                                            (evcond-cont-cont cont))))
        ((evlis-cont-p cont)    (evlis (evlis-cont-fn cont)
                                       (cdr (evlis-cont-unevaled cont))
                                       (cons arg (evlis-cont-evaled cont))
                                       (evlis-cont-env cont)
                                       (evlis-cont-block-env cont)
                                       (evlis-cont-go-env cont)
                                       (evlis-cont-catch-env cont)
                                       (evlis-cont-errcont cont)
                                       (evlis-cont-cont cont)))
        (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'bad-cont))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1077;&#1088;&#1089;&#1080;&#1103; ASSOC</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-2</span> (key alist cont errcont) <span style="color: #af0000;">;; </span><span style="color: #af0000;">NB!: inverted order of</span>
  <span style="color: #af0000;">;; </span><span style="color: #af0000;">continuations (for lookup)</span>
  (<span style="color: #af00ff;">cond</span> ((null alist)              (funcall errcont key))
        ((equal key (caar alist))  (funcall cont    (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">assoc-2</span> (key alist cont errcont) <span style="color: #af0000;">;; </span><span style="color: #af0000;">NB!: inverted order of</span>
  <span style="color: #af0000;">;; </span><span style="color: #af0000;">continuations (for lookup)</span>
  (<span style="color: #af00ff;">cond</span> ((null alist)              (apply-continuation errcont key))
        ((equal key (caar alist))  (apply-continuation cont (cdar alist)))
        (t                         (assoc-2 key (cdr alist) cont errcont))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1050;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;</span>
(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">unknown-function</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((fn <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:fn</span>  <span style="color: #5f5f87;">:reader</span> fn))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYAPPLY: unknown-function: ~A"</span>
             (fn condition)))))
(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">invalid-number-of-arguments</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((fn <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:fn</span>  <span style="color: #5f5f87;">:reader</span> fn))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYAPPLY: invalid-number-of-arguments: ~A"</span>
             (fn condition)))))
(<span style="color: #af00ff;">define-condition</span> <span style="color: #0000ff;">mypairlis-error</span> (<span style="color: #ff0000; font-weight: bold;">error</span>)
  ((lst1 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst1</span>  <span style="color: #5f5f87;">:reader</span> lst1)
   (lst2 <span style="color: #5f5f87;">:initarg</span> <span style="color: #5f5f87;">:lst2</span>  <span style="color: #5f5f87;">:reader</span> lst2))
  (<span style="color: #5f5f87;">:report</span>
   (<span style="color: #af00ff;">lambda</span> (condition stream)
     (format stream <span style="color: #87005f;">"Error in MYPAIRLIS: wrong params:~%'~A~%'~A"</span>
             (lst1 condition) (lst2 condition)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1053;&#1086;&#1074;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; lookup</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">environment</span>
(<span style="color: #af00ff;">defparameter</span> <span style="color: #af5f00;">*glob-env*</span> nil)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">lookup (old)</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env errcont cont)
  (assoc-2 symb env cont
           (<span style="color: #af00ff;">lambda</span> (key)
             (assoc-2 key *glob-env* cont
                      (<span style="color: #af00ff;">lambda</span> (key)
                        (funcall errcont
                                 (format
                                  nil
                                  <span style="color: #87005f;">"UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"</span>
                                  key env *glob-env*)))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">lookup</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">lookup</span> (symb env errcont cont)
  (assoc-2 symb env
           (<span style="color: #af00ff;">lambda</span> (x)
             (apply-continuation cont x))
           (<span style="color: #af00ff;">lambda</span> (key)
             (assoc-2 key *glob-env* cont
                      (<span style="color: #af00ff;">lambda</span> (key)
                        (apply-continuation
                         errcont
                         (format
                          nil <span style="color: #87005f;">"UNBOUD VARIABLE [~A] ~%LOCAL ENV: [~A] ~%GLOBAL ENV: [~A]"</span>
                          key env *glob-env*)))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1085;&#1080;&#1103;</span>
(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">closure</span>
  body
  env
  block-env
  go-env
  args)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; MYAPPLY &#1080; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1082; &#1085;&#1077;&#1084;&#1091; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103;</span>
(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">evlis-cont</span>
  fn unevaled evaled env block-env go-env catch-env errcont cont)
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evadd</span> (lst acc)
  (<span style="color: #af00ff;">cond</span> ((null lst)        0)
        ((null (cdr lst))  (+ acc (car lst)))
        (t                 (evadd (cdr lst)
                                  (+ acc (car lst))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evmul</span> (lst acc)
  (<span style="color: #af00ff;">cond</span> ((null lst)        1)
        ((null (cdr lst))  (* acc (car lst)))
        (t                 (evmul (cdr lst)
                                  (* acc (car lst))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) catch-env errcont cont))
        (t                (myeval (car unevaled) env block-env go-env catch-env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evlis fn
                                           (cdr unevaled)
                                           (cons x evaled)
                                           env block-env go-env catch-env
                                           errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlis</span> (fn unevaled evaled env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null unevaled)  (myapply fn (reverse evaled) catch-env errcont cont))
        (t                (myeval (car unevaled) env block-env go-env catch-env errcont
                                  (make-evlis-cont
                                   <span style="color: #5f5f87;">:fn</span> fn
                                   <span style="color: #5f5f87;">:unevaled</span> unevaled
                                   <span style="color: #5f5f87;">:evaled</span> evaled
                                   <span style="color: #5f5f87;">:env</span> env
                                   <span style="color: #5f5f87;">:block-env</span> block-env
                                   <span style="color: #5f5f87;">:go-env</span> go-env
                                   <span style="color: #5f5f87;">:catch-env</span> catch-env
                                   <span style="color: #5f5f87;">:errcont</span> errcont
                                   <span style="color: #5f5f87;">:cont</span> cont)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myapply</span> (fn args catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal fn 'car)             (apply-continuation cont (caar args)))
    ((equal fn 'cdr)             (apply-continuation cont (cdar args)))
    ((equal fn 'cons)            (apply-continuation cont (cons (car args) (cadr args))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal fn 'car)             (funcall cont (caar args)))
    ((equal fn 'cdr)             (funcall cont (cdar args)))
    ((equal fn 'cons)            (funcall cont (cons (car args) (cadr args))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal fn 'null)            (<span style="color: #af00ff;">if</span> (null (cdr args))
                                     (apply-continuation cont (null (car args)))
                                     (<span style="color: #ff0000; font-weight: bold;">error</span> 'invalid-number-of-arguments <span style="color: #5f5f87;">:fn</span> fn)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal fn 'null)            (<span style="color: #af00ff;">if</span> (null (cdr args))
                                     (funcall cont (null (car args)))
                                     (<span style="color: #ff0000; font-weight: bold;">error</span> 'invalid-number-of-arguments <span style="color: #5f5f87;">:fn</span> fn)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal fn '+)             (apply-continuation cont (evadd args 0)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal fn '+)             (funcall cont (evadd args 0)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal fn '*)             (apply-continuation cont (evmul args 1)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal fn '*)             (funcall cont (evmul args 1)))
    ((closure-p fn)              (myeval (closure-body fn)
                                         (pairlis (closure-args fn)
                                                  args
                                                  (closure-env fn))
                                         (closure-block-env fn)
                                         (closure-go-env fn)
                                         catch-env
                                         errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal fn 'print)           (apply-continuation cont (print (car args))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal fn 'print)           (funcall cont (print (car args))))
    ((equal fn 'list)            (funcall cont args))
    (t (<span style="color: #ff0000; font-weight: bold;">error</span> 'unknown-function <span style="color: #5f5f87;">:fn</span> fn))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">CPS-&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; MYEVAL &#1080; &#1074;&#1089;&#1077; &#1095;&#1090;&#1086; &#1082; &#1085;&#1077;&#1084;&#1091; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103;</span>
(<span style="color: #af00ff;">defstruct</span> <span style="color: #008700;">evcond-cont</span>
  clauses env block-env go-env catch-env errcont cont)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null exp)  (funcall cont nil))
        (t           (myeval (caar exp) env block-env go-env catch-env errcont
                             (<span style="color: #af00ff;">lambda</span> (x)
                               (<span style="color: #af00ff;">if</span> x
                                   (myeval (cadar exp)
                                           env block-env go-env catch-env
                                           errcont cont)
                                   (evcond (cdr exp)
                                           env block-env go-env catch-env
                                           errcont cont)))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evcond</span> (clauses env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null clauses)  (apply-continuation cont nil))
        (t               (myeval (caar clauses) env block-env go-env catch-env errcont
                                 (make-evcond-cont
                                  <span style="color: #5f5f87;">:clauses</span> clauses
                                  <span style="color: #5f5f87;">:env</span> env
                                  <span style="color: #5f5f87;">:block-env</span> block-env
                                  <span style="color: #5f5f87;">:go-env</span> go-env
                                  <span style="color: #5f5f87;">:catch-env</span> catch-env
                                  <span style="color: #5f5f87;">:errcont</span> errcont
                                  <span style="color: #5f5f87;">:cont</span> cont)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)         (funcall cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env go-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env go-env catch-env errcont
                                    (<span style="color: #af00ff;">lambda</span> (x)
                                      (evprogn (cdr lst)
                                               env block-env go-env catch-env
                                               errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evprogn</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)         (apply-continuation cont nil))
        ((null (cdr lst))   (myeval (car lst) env block-env go-env catch-env errcont cont))
        (t                  (myeval (car lst) env block-env go-env catch-env errcont
                                    (<span style="color: #af00ff;">lambda</span> (x)
                                      (<span style="color: #af00ff;">declare</span> (ignore x))
                                      (evprogn (cdr lst)
                                               env block-env go-env catch-env
                                               errcont cont))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evand</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)        (funcall cont (and)))
        ((null (cdr lst))  (myeval (car lst) env block-env go-env catch-env errcont
                                   (<span style="color: #af00ff;">lambda</span> (x)
                                     (and x))))
        (t                 (and (myeval (car lst) env block-env go-env catch-env errcont
                                        (<span style="color: #af00ff;">lambda</span> (x)
                                          (and x (evand (cdr lst)
                                                        env block-env go-env catch-env
                                                        errcont cont))))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evor</span> (lst env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null lst)        (funcall cont (or)))
        ((null (cdr lst))  (myeval (car lst) env block-env go-env catch-env errcont
                                   (<span style="color: #af00ff;">lambda</span> (x)
                                     (or x))))
        (t                 (myeval (car lst) env block-env go-env catch-env errcont
                                   (<span style="color: #af00ff;">lambda</span> (x)
                                     (or x (evor (cdr lst)
                                                 env block-env go-env catch-env
                                                 errcont cont)))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">mypairlis</span> (lst1 lst2 alist)
  (<span style="color: #af00ff;">cond</span> ((and (null lst1) (null lst2))  alist)
        ((or  (null lst1) (null lst2))  (<span style="color: #ff0000; font-weight: bold;">error</span> 'mypairlis-error <span style="color: #5f5f87;">:lst1</span> lst1 <span style="color: #5f5f87;">:lst2</span> lst2))
        (t                              (cons (cons (car lst1)
                                                    (car lst2))
                                              (mypairlis (cdr lst1)
                                                         (cdr lst2)
                                                         alist)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evlet</span> (vars exps evald-exps exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null exps)  (evprogn exp
                               (pairlis vars (reverse evald-exps) env)
                               block-env go-env catch-env
                               errcont cont))
        (t            (myeval (car exps) env block-env go-env catch-env errcont
                              (<span style="color: #af00ff;">lambda</span> (x)
                                (evlet vars (cdr exps) (cons x evald-exps) exp
                                       env block-env go-env catch-env
                                       errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evletstar</span> (varpairs exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null varpairs)  (evprogn exp env block-env go-env catch-env errcont cont))
        (t                (myeval (cadar varpairs) env block-env go-env catch-env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evletstar (cdr varpairs) exp
                                               (acons (caar varpairs) x env)
                                               block-env go-env catch-env
                                               errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evletstar</span> (varpairs exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null varpairs)  (evprogn exp env block-env go-env catch-env errcont cont))
        (t                (myeval (cadar varpairs) env block-env go-env catch-env errcont
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (evletstar (cdr varpairs) exp
                                               (acons (caar varpairs) x env)
                                               block-env go-env catch-env
                                               errcont cont))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">tagbody-check-tag</span> (exp cont errcont)
  (<span style="color: #af00ff;">cond</span> ((null exp) (funcall cont))
        ((and (symbolp (car exp))
              (member (car exp) (cdr exp)))
         (funcall errcont (car exp)))
        (t (tagbody-check-tag (cdr exp) cont errcont))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evtagbody</span> (body env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null (car body))      (funcall cont nil))
        ((symbolp (car body))   (evtagbody (cdr body) env block-env go-env catch-env errcont cont))
        (t                      (myeval (car body) env block-env go-env catch-env errcont
                                        (<span style="color: #af00ff;">lambda</span> (x)
                                          (<span style="color: #af00ff;">declare</span> (ignore x))
                                          (evtagbody (cdr body) env block-env go-env catch-env errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">evtagbody</span> (body env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span> ((null (car body))      (apply-continuation cont nil))
        ((symbolp (car body))   (evtagbody (cdr body) env block-env go-env catch-env errcont cont))
        (t                      (myeval (car body) env block-env go-env catch-env errcont
                                        (<span style="color: #af00ff;">lambda</span> (x)
                                          (<span style="color: #af00ff;">declare</span> (ignore x))
                                          (evtagbody (cdr body) env block-env go-env catch-env errcont cont))))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">tagbody-slice</span> (exp)
  (<span style="color: #af00ff;">cond</span> ((null exp)           nil)
        ((symbolp (car exp))  (cons exp  (tagbody-slice (cdr exp))))
        (t                    (tagbody-slice (cdr exp)))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">tagbody-slice</span> (exp res)
  (<span style="color: #af00ff;">cond</span> ((null exp) res)
        ((symbolp (car exp))  (tagbody-slice (cdr exp) (cons exp res)))
        (t                   (tagbody-slice (cdr exp) res))))
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">myeval</span> (exp env block-env go-env catch-env errcont cont)
  (<span style="color: #af00ff;">cond</span>
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((null exp)                  (apply-continuation cont 'nil))
    ((equal 't exp)              (apply-continuation cont 't))
    ((member exp '(+ * car cdr cons null print or and))  (apply-continuation cont exp))
    ((numberp exp)               (apply-continuation cont exp))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((null exp)                  (funcall cont 'nil))
    ((equal t exp)               (funcall cont 't))
    ((member exp '(+ * car cdr cons null print list))  (funcall cont exp))
    ((numberp exp)               (funcall cont exp))
    ((symbolp exp)               (lookup exp env errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'quote)    (apply-continuation cont (cadr exp)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'quote)    (funcall cont (cadr exp)))
    ((equal (car exp) 'if)       (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (x)
                                           (<span style="color: #af00ff;">if</span> x
                                               (myeval (caddr exp)
                                                       env block-env go-env catch-env
                                                       errcont cont)
                                               (myeval (cadddr exp)
                                                       env block-env go-env catch-env
                                                       errcont cont)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'cond)     (evcond (cdr exp) env block-env go-env catch-env errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'cond)     (funcall cont (evcond (cdr exp)
                                                       env block-env go-env catch-env
                                                       errcont cont)))
    ((equal (car exp) 'progn)    (evprogn (cdr exp)
                                          env block-env go-env catch-env
                                          errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'and)      (apply-continuation cont (evand (cdr exp)
                                                                 env block-env go-env catch-env
                                                                 errcont cont)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'and)      (funcall cont (evand (cdr exp)
                                                      env block-env go-env catch-env
                                                      errcont cont)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'or)       (apply-continuation cont (evor  (cdr exp)
                                                                 env block-env go-env catch-env
                                                                 errcont cont)))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'or)       (funcall cont (evor  (cdr exp)
                                                      env block-env go-env catch-env
                                                      errcont cont)))
    ((equal (car exp) 'let)      (evlet (mapcar #'car (cadr exp))
                                        (mapcar #'cadr (cadr exp))
                                        nil
                                        (cddr exp)
                                        env block-env go-env catch-env
                                        errcont cont))
    ((equal (car exp) 'let*)     (evletstar (cadr exp)
                                            (cddr exp)
                                            env block-env go-env catch-env
                                            errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'defun)         (<span style="color: #af00ff;">progn</span>
                                        (push (cons (cadr exp)
                                                    (make-closure <span style="color: #5f5f87;">:body</span> (cadddr exp)
                                                                  <span style="color: #5f5f87;">:block-env</span> block-env
                                                                  <span style="color: #5f5f87;">:env</span> env
                                                                  <span style="color: #5f5f87;">:go-env</span> go-env
                                                                  <span style="color: #5f5f87;">:args</span> (caddr exp)))
                                              *glob-env*)
                                        (apply-continuation cont (cadr exp))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'defun)         (<span style="color: #af00ff;">progn</span>
                                        (push (cons (cadr exp)
                                                    (make-closure <span style="color: #5f5f87;">:body</span> (cadddr exp)
                                                                  <span style="color: #5f5f87;">:env</span> env
                                                                  <span style="color: #5f5f87;">:block-env</span> block-env
                                                                  <span style="color: #5f5f87;">:go-env</span> go-env
                                                                  <span style="color: #5f5f87;">:args</span> (caddr exp)))
                                              *glob-env*)
                                        (funcall cont (cadr exp))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'setq)     (myeval (caddr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (val)
                                           (<span style="color: #af00ff;">if</span> (null (assoc (cadr exp) env))
                                               (<span style="color: #af00ff;">if</span> (null (assoc (cadr exp) *glob-env*))
                                                   (push (cons (cadr exp) val)
                                                         *glob-env*)
                                                   (rplacd (assoc (cadr exp) *glob-env*) val))
                                               (rplacd (assoc (cadr exp) env) val))
                                           (apply-continuation cont val))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'setq)     (myeval (caddr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (val)
                                           (<span style="color: #af00ff;">if</span> (null (assoc (cadr exp) env))
                                               (<span style="color: #af00ff;">if</span> (null (assoc (cadr exp) *glob-env*))
                                                   (push (cons (cadr exp) val)
                                                         *glob-env*)
                                                   (rplacd (assoc (cadr exp) *glob-env*) val))
                                               (rplacd (assoc (cadr exp) env) val))
                                           (funcall cont val))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'lambda)   (apply-continuation cont (make-closure <span style="color: #5f5f87;">:body</span> (caddr exp)
                                                                        <span style="color: #5f5f87;">:block-env</span> block-env
                                                                        <span style="color: #5f5f87;">:env</span> env
                                                                        <span style="color: #5f5f87;">:go-env</span> go-env
                                                                        <span style="color: #5f5f87;">:args</span> (cadr exp))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'lambda)   (funcall cont (make-closure <span style="color: #5f5f87;">:body</span> (caddr exp)
                                                             <span style="color: #5f5f87;">:env</span> env
                                                             <span style="color: #5f5f87;">:block-env</span> block-env
                                                             <span style="color: #5f5f87;">:go-env</span> go-env
                                                             <span style="color: #5f5f87;">:args</span> (cadr exp))))
    ((equal (car exp) 'block)    (myeval (caddr exp)
                                         env
                                         (acons (cadr exp)
                                                cont
                                                block-env)
                                         go-env catch-env errcont cont))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp)
            'return-from)        (<span style="color: #af00ff;">if</span> (not (symbolp (cadr exp)))
                                     (apply-continuation errcont
                                                         (format nil
                                                                 <span style="color: #87005f;">"return-from: first argument not a symbol"</span>))
                                     (myeval (caddr exp) env block-env go-env catch-env errcont
                                             (<span style="color: #af00ff;">lambda</span> (x)
                                               (assoc-2 (cadr exp) block-env
                                                        (<span style="color: #af00ff;">lambda</span> (y) (apply-continuation y x))
                                                        (<span style="color: #af00ff;">lambda</span> (y) (apply-continuation errcont (format nil <span style="color: #87005f;">"return-from: undefined return block ~A"</span> y))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp)
            'return-from)        (<span style="color: #af00ff;">if</span> (not (symbolp (cadr exp)))
                                     (funcall errcont
                                              (format nil
                                                      <span style="color: #87005f;">"return-from: first argument not a symbol"</span>))
                                     (myeval (caddr exp) env block-env go-env catch-env errcont
                                             (<span style="color: #af00ff;">lambda</span> (x)
                                               (assoc-2 (cadr exp) block-env
                                                        (<span style="color: #af00ff;">lambda</span> (y) (funcall y x))
                                                        (<span style="color: #af00ff;">lambda</span> (y) (funcall errcont
                                                                             (format nil <span style="color: #87005f;">"return-from: undefined return block ~A"</span> y))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'catch)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (<span style="color: #af00ff;">if</span> (not (symbolp symb-res))
                                               (apply-continuation
                                                errcont
                                                (format nil <span style="color: #87005f;">"catch: first argument not a symbol"</span>))
                                               (myeval (caddr exp)
                                                       env
                                                       block-env
                                                       go-env
                                                       (acons symb-res
                                                              cont
                                                              catch-env)
                                                       errcont
                                                       cont)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'catch)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (<span style="color: #af00ff;">if</span> (not (symbolp symb-res))
                                               (funcall
                                                errcont
                                                (format nil <span style="color: #87005f;">"catch: first argument not a symbol"</span>))
                                               (myeval (caddr exp)
                                                       env
                                                       block-env
                                                       go-env
                                                       (acons symb-res
                                                              cont
                                                              catch-env)
                                                       errcont cont)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'throw)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (myeval (caddr exp) env block-env go-env catch-env errcont
                                                   (<span style="color: #af00ff;">lambda</span> (exp-res)
                                                     (assoc-2 symb-res catch-env
                                                              (<span style="color: #af00ff;">lambda</span> (cont-res)
                                                                (apply-continuation cont-res exp-res))
                                                              (<span style="color: #af00ff;">lambda</span> (key)
                                                                (apply-continuation
                                                                 errcont
                                                                 (format
                                                                  nil
                                                                  <span style="color: #87005f;">"throw: matching ~A catch is not found"</span>
                                                                  key)))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'throw)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (myeval (caddr exp) env block-env go-env catch-env errcont
                                                   (<span style="color: #af00ff;">lambda</span> (exp-res)
                                                     (assoc-2 symb-res catch-env
                                                              (<span style="color: #af00ff;">lambda</span> (cont-res)
                                                                (funcall cont-res exp-res))
                                                              (<span style="color: #af00ff;">lambda</span> (key)
                                                                (funcall
                                                                 errcont
                                                                 (format
                                                                  nil
                                                                  <span style="color: #87005f;">"throw: matching ~A catch is not found"</span>
                                                                  key)))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp)
            'return-from)        (<span style="color: #af00ff;">if</span> (not (symbolp (cadr exp)))
                                     (apply-continuation errcont
                                                         (format nil
                                                                 <span style="color: #87005f;">"return-from: first argument not a symbol"</span>))
                                     (myeval (caddr exp) env block-env go-env catch-env errcont
                                             (<span style="color: #af00ff;">lambda</span> (x)
                                               (assoc-2 (cadr exp) block-env
                                                        (<span style="color: #af00ff;">lambda</span> (y) (apply-continuation y x))
                                                        (<span style="color: #af00ff;">lambda</span> (y) (apply-continuation errcont (format nil <span style="color: #87005f;">"return-from: undefined return block ~A"</span> y))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp)
            'return-from)        (<span style="color: #af00ff;">if</span> (not (symbolp (cadr exp)))
                                     (funcall errcont
                                              (format nil
                                                      <span style="color: #87005f;">"return-from: first argument not a symbol"</span>))
                                     (myeval (caddr exp) env block-env go-env catch-env errcont
                                             (<span style="color: #af00ff;">lambda</span> (x)
                                               (assoc-2 (cadr exp) block-env
                                                        (<span style="color: #af00ff;">lambda</span> (y) (funcall y x))
                                                        (<span style="color: #af00ff;">lambda</span> (y) (funcall errcont
                                                                             (format nil <span style="color: #87005f;">"return-from: undefined return block ~A"</span> y))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'catch)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (<span style="color: #af00ff;">if</span> (not (symbolp symb-res))
                                               (apply-continuation
                                                errcont
                                                (format nil <span style="color: #87005f;">"catch: first argument not a symbol"</span>))
                                               (myeval (caddr exp)
                                                       env
                                                       block-env
                                                       go-env
                                                       (acons symb-res
                                                              cont
                                                              catch-env)
                                                       errcont
                                                       cont)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'catch)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (<span style="color: #af00ff;">if</span> (not (symbolp symb-res))
                                               (funcall
                                                errcont
                                                (format nil <span style="color: #87005f;">"catch: first argument not a symbol"</span>))
                                               (myeval (caddr exp)
                                                       env
                                                       block-env
                                                       go-env
                                                       (acons symb-res
                                                              cont
                                                              catch-env)
                                                       errcont cont)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'throw)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (myeval (caddr exp) env block-env go-env catch-env errcont
                                                   (<span style="color: #af00ff;">lambda</span> (exp-res)
                                                     (assoc-2 symb-res catch-env
                                                              (<span style="color: #af00ff;">lambda</span> (cont-res)
                                                                (apply-continuation cont-res exp-res))
                                                              (<span style="color: #af00ff;">lambda</span> (key)
                                                                (apply-continuation
                                                                 errcont
                                                                 (format
                                                                  nil
                                                                  <span style="color: #87005f;">"throw: matching ~A catch is not found"</span>
                                                                  key)))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'throw)    (myeval (cadr exp) env block-env go-env catch-env errcont
                                         (<span style="color: #af00ff;">lambda</span> (symb-res)
                                           (myeval (caddr exp) env block-env go-env catch-env errcont
                                                   (<span style="color: #af00ff;">lambda</span> (exp-res)
                                                     (assoc-2 symb-res catch-env
                                                              (<span style="color: #af00ff;">lambda</span> (cont-res)
                                                                (funcall cont-res exp-res))
                                                              (<span style="color: #af00ff;">lambda</span> (key)
                                                                (funcall
                                                                 errcont
                                                                 (format
                                                                  nil
                                                                  <span style="color: #87005f;">"throw: matching ~A catch is not found"</span>
                                                                  key)))))))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'tagbody)  (tagbody-check-tag
                                  (cdr exp)
                                  (<span style="color: #af00ff;">lambda</span> ()
                                    (setq go-env
                                          (append (mapcar #'(<span style="color: #af00ff;">lambda</span> (x)
                                                              (cons (car x)
                                                                    (<span style="color: #af00ff;">lambda</span> ()
                                                                      (evtagbody x
                                                                                 env
                                                                                 block-env
                                                                                 go-env
                                                                                 catch-env
                                                                                 errcont cont))))
                                                          (tagbody-slice (cdr exp) nil))
                                                  go-env))
                                    (evtagbody (cdr exp) env block-env go-env catch-env errcont cont))
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (apply-continuation
                                     errcont
                                     (format
                                      nil
                                      <span style="color: #87005f;">"tagbody: The tag ~A appears more than once in a tagbody"</span> x)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'tagbody)  (tagbody-check-tag
                                  (cdr exp)
                                  (<span style="color: #af00ff;">lambda</span> ()
                                    (setq go-env
                                          (append (mapcar #'(<span style="color: #af00ff;">lambda</span> (x)
                                                              (cons (car x)
                                                                    (<span style="color: #af00ff;">lambda</span> ()
                                                                      (evtagbody x
                                                                                 env
                                                                                 block-env
                                                                                 go-env
                                                                                 catch-env
                                                                                 errcont cont))))
                                                          (tagbody-slice (cdr exp) nil))
                                                  go-env))
                                    (evtagbody (cdr exp) env block-env go-env catch-env errcont cont))
                                  (<span style="color: #af00ff;">lambda</span> (x)
                                    (funcall
                                     errcont
                                     (format
                                      nil
                                      <span style="color: #87005f;">"tagbody: The tag ~A appears more than once in a tagbody"</span> x)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1089;&#1090;&#1072;&#1083;&#1086;</span>
    ((equal (car exp) 'go)       (assoc-2 (cadr exp) go-env
                                          (<span style="color: #af00ff;">lambda</span> (x)
                                            (apply-continuation x 'NOT-A-PARAM))
                                          (<span style="color: #af00ff;">lambda</span> (x)
                                            (apply-continuation
                                             errcont
                                             (format nil <span style="color: #87005f;">"go: wrong target ~A"</span> x)))))
    <span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1073;&#1099;&#1083;&#1086;</span>
    ((equal (car exp) 'go)       (assoc-2 (cadr exp) go-env
                                          (<span style="color: #af00ff;">lambda</span> (x)
                                            (funcall x))
                                          (<span style="color: #af00ff;">lambda</span> (x)
                                            (funcall
                                             errcont
                                             (format nil <span style="color: #87005f;">"go: wrong target ~A"</span> x)))))
    ((equal (car exp) 'labels)   (<span style="color: #af00ff;">let*</span> ((alist (mapcar (<span style="color: #af00ff;">lambda</span> (label)
                                                         (cons (car label) nil))
                                                       (cadr exp)))
                                        (new-env (append alist env))
                                        (closures (mapcar (<span style="color: #af00ff;">lambda</span> (label)
                                                            (make-closure <span style="color: #5f5f87;">:body</span> (caddr label)
                                                                          <span style="color: #5f5f87;">:block-env</span> block-env
                                                                          <span style="color: #5f5f87;">:env</span> new-env
                                                                          <span style="color: #5f5f87;">:go-env</span> go-env
                                                                          <span style="color: #5f5f87;">:args</span> (cadr label)))
                                                          (cadr exp))))
                                   (<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (length alist) (length closures)))
                                   (<span style="color: #af00ff;">loop</span>
                                      <span style="color: #5f5f87;">:for</span> aelt     <span style="color: #5f5f87;">:in</span> alist
                                      <span style="color: #5f5f87;">:for</span> closure  <span style="color: #5f5f87;">:in</span> closures
                                      <span style="color: #5f5f87;">:do</span> (rplacd aelt closure))
                                   (evprogn (cddr exp) new-env block-env go-env catch-env errcont cont)))
    (t
     (myeval (car exp) env block-env go-env catch-env errcont
             (<span style="color: #af00ff;">lambda</span> (x)
               (evlis x (cdr exp) nil env block-env go-env catch-env errcont cont))))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1085;&#1086;&#1074;&#1099;&#1081; lookup</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">test lookup</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"ok:123"</span> (lookup 'aaa '((aaa . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"err:~A"</span> x))
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil      (lookup 'aaa '((bbb . 123))
                                (<span style="color: #af00ff;">lambda</span> (x) (<span style="color: #af00ff;">declare</span> (ignore x)) nil)
                                (<span style="color: #af00ff;">lambda</span> (x) (format nil <span style="color: #87005f;">"ok:~A"</span> x)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1076;&#1083;&#1103; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; CPS-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">ok</span> (x)
  (format t <span style="color: #87005f;">"~%ok: ~A"</span> x)
  x)
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">err</span> (x)
  (format t <span style="color: #87005f;">"~%err: ~A"</span> x)
  x)
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYAPPLY</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; cons, car, cdr</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(cons 1 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 2) 3 . 4) (myeval '(cons (cons 1 2) (cons 3 4)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(car (cons 2 3)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(cdr (cons 2 3)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(car (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 . 4) (myeval '(cdr (cons (cons 1 2) (cons 3 4))) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; cons-&#1103;&#1095;&#1077;&#1077;&#1082;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(car a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(cdr a) '((a . (1 . 2))) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(car b) '((a . (1 . 2)) (b . (3 . 4))) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; NULL</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null ()) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null T) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval '(null a) '((a . ())) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; NULL, &#1089; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a) '((a . T)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval '(null a) '((a . 1)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVADD</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 0                (evadd '() 0)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2                (evadd '(2) 0)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 5                (evadd '(2 3) 0)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2 3 4)        (evadd '(2 3 4) 0)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVMUL</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1                (evmul '() 1)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2                (evmul '(2) 1)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6                (evmul '(2 3) 1)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2 3 4)        (evmul '(2 3 4) 1)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 0                (myeval '(+) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2)            (myeval '(+ 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2 3)          (myeval '(+ 2 3) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2 3 4)        (myeval '(+ 2 3 4) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2 (+ 3 4))    (myeval '(+ 2 (+ 3 4)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 2 (+ 3 4) 5)  (myeval '(+ 2 (+ 3 4) 5) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1                (myeval '(*) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2)            (myeval '(* 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2 3)          (myeval '(* 2 3) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2 3 4)        (myeval '(* 2 3 4) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2 (* 3 4))    (myeval '(* 2 (* 3 4)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (* 2 (* 3 4) 5)  (myeval '(* 2 (* 3 4) 5) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 0
               (myeval '(+) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2))
                 (+ a))
               (myeval '(+ a)
                       '((a . 2))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3))
                 (+ a b))
               (myeval '(+ a b)
                       '((a . 2) (b . 3))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4))
                 (+ a b c))
               (myeval '(+ a b c)
                       '((a . 2) (b . 3) (c . 4))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4))
                 (+ a (+ b c)))
               (myeval '(+ a (+ b c))
                       '((a . 2) (b . 3) (c . 4))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4) (d 5))
                 (+ a (+ b c) d))
               (myeval '(+ a (+ b c) d)
                       '((a . 2) (b . 3) (c . 4) (d . 5))
                       nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;  &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1
               (myeval '(*) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2))
                 (* a))
               (myeval '(* a)
                       '((a . 2))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3))
                 (* a b))
               (myeval '(* a b)
                       '((a . 2) (b . 3))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4))
                 (* a b c))
               (myeval '(* a b c)
                       '((a . 2) (b . 3) (c . 4))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4))
                 (* a (* b c)))
               (myeval '(* a (* b c))
                       '((a . 2) (b . 3) (c . 4))
                       nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 2) (b 3) (c 4) (d 5))
                 (* a (* b c) d))
               (myeval '(* a (* b c) d)
                       '((a . 2) (b . 3) (c . 4) (d . 5))
                       nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; CLOSURE</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(((<span style="color: #af00ff;">lambda</span> (x)
                              (<span style="color: #af00ff;">lambda</span> (y) x))
                            1)
                           2)
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089; host-&#1086;&#1074;&#1099;&#1084; print</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (print 12))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print 12) nil nil nil nil #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (print 12)
               (myeval '(print 12) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; PRINT &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (<span style="color: #af00ff;">let</span> ((a 12))
                   (print a)))
               (<span style="color: #af00ff;">with-output-to-string</span> (*standard-output*)
                 (myeval '(print a)
                         '((b . 23) (a . 12))
                         nil nil nil #'err #'identity))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 12))
                 (print a))
               (myeval '(print a)
                       '((b . 23) (a . 12))
                       nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 4           (evlis '+     '(1 (+ 1 2))   nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (+ 1 3 5)   (evlis '+     '(1 (+ 1 2) 5) nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 3 5)    (evlis 'list  '(1 (+ 1 2) 5) nil nil nil nil nil  #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(0 3 6 42) (evlis 'list  '(0 (+ a b) (* b c) 42)
                                  nil
                                  '((a . 1) (b . 2) (c . 3) (d . 4))
                                  nil nil nil  #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LIST</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 14) (myeval '(list 1 (+ 2 (* 3 4)))
                               nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ 1 2) (* 2 3) 42) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 6 42)
               (myeval '(list (+ a b) (* b c) 42)
                       '((a . 1) (b . 2) (c . 3) (d . 4))
                       nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYEVAL</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1089;&#1072;&#1084;&#1086;&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal T (myeval 'T nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal NIL (myeval 'NIL nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 999 (myeval 999 nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 6 (myeval 'b '((a . 3) (b . 6)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (car (myeval 'b nil nil nil nil
                                    #'(<span style="color: #af00ff;">lambda</span> (x) (cons <span style="color: #87005f;">"error"</span> x))
                                    #'ok))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; QUOTE</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(+ 1 2) (myeval '(quote (+ 1 2)) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; IF</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> () 1 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> (null ()) 1 2) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; IF, &#1075;&#1076;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . ())) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">if</span> a 1 2) '((a . 1)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVCOND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2   (evcond '((t 2)   (t 1)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1   (evcond '((nil 2) (t 1)) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (evcond '((nil 2) (nil 1)) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVCOND, &#1075;&#1076;&#1077; &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1077;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evcond '((a 2) (b 1))
                         '((a . 1) (b . ()))
                         nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (evcond '((a 2) (b 1))
                         '((a . nil) (b . T))
                         nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; COND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (() 1)
                           (1 2))
                         nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . ()) (b . 1))
                         nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 1 (myeval '(<span style="color: #af00ff;">cond</span>
                           (a 1)
                           (b 2))
                         '((a . 1) (b . ()))
                         nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evprogn '(1 2) nil nil nil nil  #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; EVPROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (evprogn '(a b c)
                          '((a . 1) (b . 2) (c . 3))
                          nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> 1 2 3) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; &#1076;&#1083;&#1103; PROGN &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">progn</span> a b c) '((a . 1) (b . 2) (c . 3))
                         nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVAND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and)           (evand '() nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1)         (evand '(1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and nil)       (evand '(nil) nil nil nil  nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 nil)     (evand '(1 nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 nil)   (evand '(1 2 nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 3)     (evand '(1 2 3) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVAND &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil))
                 (and nil))
               (evand '(a) '((a . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1))
                 (and a))
               (evand '(a) '((a . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b nil))
                 (and a b))
               (evand '(a b) '((a . 1) (b . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b 2)
                     (c nil))
                 (and a b c))
               (evand '(a b c) '((a . 1) (b . 2) (c . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b 2)
                     (c 3))
                 (and a b c))
               (evand '(a b c) '((a . 1) (b . 2) (c . 3)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; AND</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and)                (myeval '(and) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1)              (myeval '(and 1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and nil)            (myeval '(and nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 nil)          (myeval '(and 1 nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 nil)        (myeval '(and 1 2 nil) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 2 3)          (myeval '(and 1 2 3) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (and 1 (and 1 2) 3)  (myeval '(and 1 (and 1 2) 3) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; AND &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil))
                 (and nil))
               (myeval '(and a) '((a . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1))
                 (and a))
               (myeval '(and a) '((a . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b nil))
                 (and a b))
               (myeval '(and a b) '((a . 1) (b . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b 2)
                     (c nil))
                 (and a b c))
               (myeval '(and a b c) '((a . 1) (b . 2) (c . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1)
                     (b 2)
                     (c 3))
                 (and a b c))
               (myeval '(and a b c) '((a . 1) (b . 2) (c . 3)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVOR</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or)           (evor '() nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil 1)     (evor '(nil 1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil nil 1) (evor '(nil nil 1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil 1 2)   (evor '(nil 1 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or 1 2 3)     (evor '(1 2 3) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVOR &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil))
                 (or a))
               (evor '(a) '((a . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1))
                 (or a))
               (evor '(a) '((a . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b 1))
                 (or a b))
               (evor '(a b) '((a . nil) (b . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b nil)
                     (c 3))
                 (or a b c))
               (evor '(a b c) '((a . nil) (b . nil) (c . 3)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b 1)
                     (c 2))
                 (or a b c))
               (evor '(a b c) '((a . nil) (b . 1) (c . 2)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; OR</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or)                  (myeval '(or) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil 1)            (myeval '(or nil 1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil nil 1)        (myeval '(or nil nil 1) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil 1 2)          (myeval '(or nil 1 2) nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (or nil (or 3 2) 2)   (myeval '(or nil (or 3 2) 2) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; OR &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil))
                 (or a))
               (myeval '(or a) '((a . nil)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a 1))
                 (or a))
               (myeval '(or a) '((a . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b 1))
                 (or a b))
               (myeval '(or a b) '((a . nil) (b . 1)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b nil)
                     (c 3))
                 (or a b c))
               (myeval '(or a b c) '((a . nil) (b . nil) (c . 3)) nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal (<span style="color: #af00ff;">let</span> ((a nil)
                     (b 1)
                     (c 2))
                 (or a b c))
               (myeval '(or a b c) '((a . nil) (b . 1) (c . 2)) nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; MYPAIRLIS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(( a . 1) (b . 2) ( c . 3) (z . 6) (y . 77))
               (mypairlis '(a b c) '(1 2 3) '((z . 6) (y . 77)))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis '(a b c) nil '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span>
               (<span style="color: #af00ff;">handler-case</span> (mypairlis nil '(1 2 3) '((z . 6) (y . 77)))
                 (MYPAIRLIS-ERROR (condition) <span style="color: #87005f;">"error"</span>))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVLET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (evlet '(a b) '(1 2) nil '(4 (+ a b)) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LET</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 2) (myeval '(<span style="color: #af00ff;">let</span> ((a 1)
                                       (b 2))
                                  (cons a b))
                                nil nil nil nil
                                #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; EVLETSTAR</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 2 (evletstar '((a 1) (b a)) '(4 (+ a b)) nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LET*</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(3 1 . 2) (myeval '(<span style="color: #af00ff;">let*</span> ((a 1)
                                          (b 2)
                                          (c (+ a b)))
                                    (cons c (cons a b)))
                                  nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; DEFUN</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 64 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (myeval '(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">alfa</span> (x) (* x x)) nil nil nil nil #'err #'ok)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(alfa 8) nil nil nil nil #'err #'ok)
                      (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; SETQ</span>
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;, &#1085;&#1077; &#1079;&#1072;&#1090;&#1088;&#1072;&#1075;&#1080;&#1074;&#1072;&#1103; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((2 . 2) ((alfa . 0)))
               (<span style="color: #af00ff;">progn</span>
                 (setf *glob-env* '((alfa . 0)))
                 (<span style="color: #af00ff;">prog1</span> (list (myeval '(cons (setq alfa 2)
                                        alfa)
                                      '((alfa . 1))
                                      nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; (&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;)</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 1) ((ALFA . 1) (BETA . 222)))
               (<span style="color: #af00ff;">progn</span>
                 (setf *glob-env* '((beta . 222)))
                 (<span style="color: #af00ff;">prog1</span> (list (myeval '(cons
                                        (setq alfa 1)
                                        alfa)
                                      nil nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '((1 . 1) ((BETA . 1)))
               (<span style="color: #af00ff;">progn</span>
                 (setf *glob-env* '((beta . 222)))
                 (<span style="color: #af00ff;">prog1</span> (list (myeval '(cons
                                        (setq beta 1)
                                        beta)
                                      nil nil nil nil #'err #'ok)
                              *glob-env*)
                   (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LAMBDA</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '((<span style="color: #af00ff;">lambda</span> (x) (+ 1  x)) 2)
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LAMBDA &#1074; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 5 (myeval '(<span style="color: #af00ff;">let</span> ((y 3))
                           ((<span style="color: #af00ff;">lambda</span> (x) (+ y x)) 2))
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; BLOCK</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (myeval '(<span style="color: #af00ff;">block</span> testblock)
                           nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">block</span> testblock 3)
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; RETURN-FROM</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">block</span> testblock (<span style="color: #af00ff;">return-from</span> testblock (+ 1 2)) 777)
                         nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (myeval '(<span style="color: #af00ff;">block</span> testblock (<span style="color: #af00ff;">return-from</span> notblock (+ 1 2)) 777)
                               nil nil nil nil #'(<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>) #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (myeval '(<span style="color: #af00ff;">progn</span> (<span style="color: #af00ff;">return-from</span> not-found-block (+ 1 2)) 777)
                               nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                               #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; RETURN-FROM &#1074; &#1083;&#1077;&#1082;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 12 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(<span style="color: #af00ff;">progn</span>
                                     (<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (x)
                                       (<span style="color: #af00ff;">block</span> in-lambda-block
                                         (<span style="color: #af00ff;">return-from</span> in-lambda-block
                                           (+ x 2)))
                                       777)
                                     (foo 10))
                                   nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                                   #'ok)
                      (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; RETURN-FROM &#1074; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;)</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (<span style="color: #af00ff;">progn</span>
                         (setf *glob-env* nil)
                         (<span style="color: #af00ff;">prog1</span> (myeval '(<span style="color: #af00ff;">progn</span>
                                          (<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (x)
                                            (<span style="color: #af00ff;">return-from</span> in-lambda-block
                                              (+ x 2))
                                            777)
                                          (<span style="color: #af00ff;">block</span> in-lambda-block
                                            (foo 10)))
                                        nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                                        #'ok)
                           (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; CATCH</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (myeval '(<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">zzz</span>)
                           nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">zzz</span> 3)
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; THROW</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">testcatch</span> (<span style="color: #af00ff;">throw</span> '<span style="color: #008787;">testcatch</span> (+ 1 2)) 777)
                         nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (myeval '(<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">testcatch</span> (<span style="color: #af00ff;">throw</span> '<span style="color: #008787;">notcatch</span> (+ 1 2)) 777)
                               nil nil nil nil
                               #'(<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                               #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal <span style="color: #87005f;">"error"</span> (myeval '(<span style="color: #af00ff;">progn</span> (<span style="color: #af00ff;">throw</span> '<span style="color: #008787;">not-found-catch</span> (+ 1 2)) 777)
                               nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                               #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; THROW &#1074; &#1083;&#1077;&#1082;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 12 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(<span style="color: #af00ff;">progn</span>
                                     (<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (x)
                                       (<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">in-lambda-catch</span>
                                         (<span style="color: #af00ff;">throw</span> '<span style="color: #008787;">in-lambda-catch</span>
                                           (+ x 2)))
                                       777)
                                     (foo 10))
                                   nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                                   #'ok)
                      (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090; THROW &#1074; &#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;)</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 12 (<span style="color: #af00ff;">progn</span>
                    (setf *glob-env* nil)
                    (<span style="color: #af00ff;">prog1</span> (myeval '(<span style="color: #af00ff;">progn</span>
                                     (<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">foo</span> (x)
                                       (<span style="color: #af00ff;">throw</span> '<span style="color: #008787;">in-lambda-catch</span>
                                         (+ x 2))
                                       777)
                                     (<span style="color: #af00ff;">catch</span> '<span style="color: #008787;">in-lambda-catch</span>
                                       (foo 10)))
                                   nil nil nil nil (<span style="color: #af00ff;">lambda</span> (x) <span style="color: #87005f;">"error"</span>)
                                   #'ok)
                      (setf *glob-env* nil)))))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; TAGBODY</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (myeval '(<span style="color: #af00ff;">tagbody</span> a 1)
                           nil nil nil nil #'err #'ok)))
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal nil (myeval '(<span style="color: #af00ff;">tagbody</span> a 1 b 2)
                           nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; GO</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 4) (myeval '(<span style="color: #af00ff;">let</span> ((alfa 0))
                                  (<span style="color: #af00ff;">tagbody</span>
                                   a (setq alfa 1)
                                   b (<span style="color: #af00ff;">go</span> d)
                                   c (setq alfa (cons alfa 3))
                                   d (setq alfa (cons alfa 4)))
                                  alfa)
                                nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; "&#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1093;&#1086;&#1076;&#1072;" GO</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal '(1 . 5) (myeval '(<span style="color: #af00ff;">let</span> ((alfa 0))
                                  (<span style="color: #af00ff;">tagbody</span>
                                   a (<span style="color: #af00ff;">go</span> d)
                                   b (setq alfa 1)
                                   c (<span style="color: #af00ff;">go</span> e)
                                   d (<span style="color: #af00ff;">go</span> b)
                                   e (setq alfa (cons alfa 5)))
                                  alfa)
                                nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">&#1058;&#1077;&#1089;&#1090;&#1099; &#1076;&#1083;&#1103; LABELS</span>
(<span style="color: #ff0000; font-weight: bold;">assert</span> (equal 3 (myeval '(<span style="color: #af00ff;">labels</span> ((zzz (lst acc)
                                    (<span style="color: #af00ff;">cond</span> ((null lst) acc)
                                          (t (zzz (cdr lst) (+ 1 acc))))))
                           (zzz '(1 2 3) 0))
                         nil nil nil nil #'err #'ok)))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">REPL</span>
(<span style="color: #af00ff;">defun</span> <span style="color: #0000ff;">repl</span> ()
  (princ <span style="color: #87005f;">"microlisp&gt;"</span>)
  (princ (myeval (read) nil #'identity #'identity))
  (terpri)
  (finish-output)
  (repl))
<span style="color: #af0000;">;; </span><span style="color: #af0000;">(repl)</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
